$(function(){
    //声明省份城市数组
    var provinces = [
        ["北京"],
        ["重庆"],
        ["天津"],
        ["上海"],
        ["河北","石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],
        ["山西","太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],
        ["辽宁","沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],
        ["吉林","长春","吉林","四平","辽源","通化","白山","白城","松原","延边","长白山","梅河口","公主岭"],
        ["黑龙江","哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],
        ["江苏","南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","秦州","宿迁"],
        ["浙江","杭州","宁波","温州","绍兴","湖州","嘉兴","金华","衢州","台州","丽水","舟山"],
        ["安徽","合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","阜阳","宿州","滁州","六安","宣城","池州","亳州"],
        ["福建","厦门","福州","泉州","漳州","南平","三明","龙岩","莆田","宁德","平潭"],
        ["江西","南昌","九江","上饶","抚州","宜春","吉安","赣州","景德镇","萍乡","新余","鹰潭"],
        ["山东","济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","滨州","德州","临沂","菏泽","莱芜","聊城"],
        ["河南","郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店","济源"],
        ["湖北","黄冈","黄石","荆门","荆州","鄂州","十堰","随州","武汉","孝感","咸宁","襄阳","宜昌","恩施","神农架","潜江","天门","仙桃"],
        ["湖南","长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","娄底","郴州","永州","怀化","湘西"],
        ["广东","广州","深圳","珠海","汕头","佛山","韶关","湛江","肇庆","江门","茂名","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],
        ["海南","海口","三亚","三沙","儋州"],
        ["四川","成都","绵阳","自贡","攀枝花","泸州","德阳","广元","遂宁","内江","乐山","资阳","宜宾","南充","达州","雅安","阿坝","甘孜","凉山","广安","巴中","眉山"],
        ["贵州","贵阳","六盘水","遵义","安顺","毕节","铜仁","黔西","黔东南","黔南"],
        ["云南","昆明","曲靖","玉溪","昭通","保山","丽江","普洱","临沧","德宏","怒江","迪庆","大理","楚雄","红河","文山","西双版纳"],
        ["陕西","西安","宝鸡","咸阳","渭南","铜川","延安","榆林","安康","汉中","商洛","杨凌"],
        ["甘肃","兰州","嘉峪关","金昌","白银","天水","酒泉","张掖","武威","定西","陇南","平凉","庆阳","临夏","甘南"],
        ["青海","西宁","海东","海北","黄南","海南","果洛","玉树","海西"],
        ["台湾"],
        ["内蒙古","呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安盟","锡林郭勒","阿拉善"],
        ["广西","南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],
        ["西藏","拉萨","昌都","日喀则","林芝","山南","那曲地区","阿里地区"],
        ["宁夏","银川","石嘴山","吴忠","固原","中卫"],
        ["新疆","乌鲁木齐","克拉玛依","吐鲁番","哈密","阿克苏地区","喀什地区","和田地区","昌吉","博尔塔拉","巴音郭楞","克孜勒苏","伊犁"],
        ["香港"],
        ["澳门"]
        ];
        //采用匿名函数自我执行来对返回界面做一些调整
        (function($){
            var selValue = $("#provinces").val();
            var selInner = "";
            if(!(selValue =="北京" || selValue =="重庆" || selValue =="天津" || selValue =="上海" || selValue =="台湾" || selValue =="香港" || selValue =="澳门")){
                //如果不是直辖市以及特别行政区就执行以下操作
                for(var i=0;i<provinces.length;i++){
                    if(selValue==provinces[i][0]){
                        selInner += "<select id='disel' name='job_city'>";              //为新添加的元素设置id以及name属性
                        for(var j=1;j<provinces[i].length;j++){
                            selInner += "<option>"+provinces[i][j]+"</option>";
                        }
                    }
                    selInner +="</select>";
                }  
                $("#address").append(selInner);                 //添加新元素
            }
        })(jQuery);
        //如果省份选择框值发生改变执行以下代码
    $("#provinces").change(function(){
        var selValue = $(this).val();
        var selInner = "";                  //
        if(!(selValue =="北京" || selValue =="重庆" || selValue =="天津" || selValue =="上海" || selValue =="台湾" || selValue =="香港" || selValue =="澳门")){
            //如果不是直辖市以及特别行政区就执行以下操作
            for(var i=0;i<provinces.length;i++){
                if(selValue==provinces[i][0]){
                    $("#disel").remove();
                    selInner += "<select id='disel' name='job_city'>";              //为新添加的元素设置id以及name属性
                    for(var j=1;j<provinces[i].length;j++){
                        selInner += "<option>"+provinces[i][j]+"</option>";
                    }
                }
                selInner +="</select>";
            }  
            $("#address").append(selInner);                 //添加新元素
        }
        else{
            //如果是直辖市以及特别行政区就移除第二个选择框
            $("#disel").remove();
        }
    });
    $("select").change(function(){                  //下拉框的值变化则字体颜色发生变化
        $(this).css("color","black");
    });
    $("#my_submit").bind("click",function(){
        // //点击按钮之后检验输入是否为空
        var input_index=0;
        var email=/^[a-zA-Z0-9_\.\-]+@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+$/g;                  //email的正则表达式
        while (input_index<8){                  //对各个input元素进行判断，若为空则阻止提交表单，并且获得焦点
            if ($("input:eq("+input_index+")").val()==""){
                $("input:eq("+input_index+")").focus();
                return false;
            }
            input_index++;
        }
        input_index = 0;
        while (input_index<6){
            //不包括日期插件和地区下拉选择列表
            if ($("select:eq("+input_index+")").val()==""){
                $("select:eq("+input_index+")").focus();
                return false;
            }
            input_index++;
        }
        if ($("textarea").val()==""){
            $("textarea").focus();
            return false;
        }
        if (!email.test($("#mail_address").val())){                 //判断邮箱的基本形式
            $("#mail_address").focus();
            return false;
        }
        return true;
    });
});